print(8 + 2) #მიმატება
print(15 - 7) #გამოკლება
print(4 * 3) #გამრავლება
print(25 / 5) #გაყოფა

#მოცემული ხაზები იბეჭდება შემდეგი არითმეტიკული მოქმედების შედეგად
# 8-ს რომ 2 მივუმატოთ მივიღებთ 10-ს
#15-ს რომ 7 გამოვაკლოთ მივიღებთ 8-ს
#4-ის 3-ზე გამრავლებით მივიღებთ 12-ს
#25-ის 5-ზე გაყოფით მივიღებთ 5.0-ს

#პითონის კოდი მუშაობს ეტაპობრივად. კოდის დაწერის შემდეგ, ჩვენ მას ვუშვებთ ხელსაწყოს გამოყენებით, რომელსაც ეწოდება Python interpreter-ი
#ტერმინალი ჰგავს სამზარეულოს, სადაც ჩვენ საჭმელს ვამზადებთ, მაგრამ საკვების ნაცვლად ამშემთხვევაში, ჩვენ ვმუშაობთ კოდით, რათა  კომპიუტერით მუშაობა შევძლოთ. ტერმინალის მეშვეობით ჩვენ ასევე ვიღებთ დაბეჭდვის შედეგს.

num1 = 10
num2 = 5
print(num1 + num2)

#string-ი  არის ტექსტი, რომელიც შედგება ასოების, რიცხვების ან სიმბოლოებისგან. ზველაფერი არის სტრინგი რაც არის ბრჭზალებში.
#integer-ი არის რიცხვის ტიპი, რომელიც მოიცავს მხოლოდ მთელ რიცხვებს.

name = "nia"
surname = "chanturidze"
print(name + " " + surname)
